#include <iostream>
#include <string>
using namespace std;

int main() {

  char c[200] = "abcd*w123z";
  cout<<"c -> \""<<c<<"\"\n";
  c[4]=0;
  cout<<"c -> \""<<c<<"\"\n";
  cout<<"c+5 -> \""<<c+5<<"\"\n\n";

  string s = "abcd*w123z";
  cout<<"s -> \""<<s<<"\"\n";
  s[4]=0;
  cout<<"s -> \""<<s<<"\"\n";
  // s.c_str() връща указател към константен знак,
  // т. е. стойност от тип const char *
  // и с нея като край на низ се интерпретира първия нулев байт
  cout<<"s.c_str() -> \""<<s.c_str()<<"\"\n";
  cout<<"s.c_str()+5 -> \""<<s.c_str()+5<<"\"\n\n";

  string s2="wW\000\^*&"; // знак с код нула между 'c' и '^'
  // В инициализацията отдясно на оператора = стои указател
  // и затова за край на низ се приема първият нулев байт.
  cout<<"s2 -> \""<<s2<<"\"\n";
  cout<<"s2.c_str() -> \""<<s2.c_str()<<"\"\n";
}